tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/pmu_regs.h
/*
   Field values
*/

#define MXC_V_PMU_CFG_TO_SEL_TICKS_4                        ((uint32_t)(0x00000000UL))
#define MXC_V_PMU_CFG_TO_SEL_TICKS_8                        ((uint32_t)(0x00000001UL))
#define MXC_V_PMU_CFG_TO_SEL_TICKS_16                       ((uint32_t)(0x00000002UL))
#define MXC_V_PMU_CFG_TO_SEL_TICKS_32                       ((uint32_t)(0x00000003UL))
#define MXC_V_PMU_CFG_TO_SEL_TICKS_64                       ((uint32_t)(0x00000004UL))
#define MXC_V_PMU_CFG_TO_SEL_TICKS_128                      ((uint32_t)(0x00000005UL))
#define MXC_V_PMU_CFG_TO_SEL_TICKS_256                      ((uint32_t)(0x00000006UL))
#define MXC_V_PMU_CFG_TO_SEL_TICKS_512                      ((uint32_t)(0x00000007UL))

#define MXC_V_PMU_CFG_PS_SEL_DISABLE                        ((uint32_t)(0x00000000UL))
#define MXC_V_PMU_CFG_PS_SEL_DIV_2_8                        ((uint32_t)(0x00000001UL))
#define MXC_V_PMU_CFG_PS_SEL_DIV_2_16                       ((uint32_t)(0x00000002UL))
#define MXC_V_PMU_CFG_PS_SEL_DIV_2_24                       ((uint32_t)(0x00000003UL))

/* Op codes */
#define PMU_MOVE_OP                                         0
#define PMU_WRITE_OP                                        1
#define PMU_WAIT_OP                                         2
#define PMU_JUMP_OP                                         3
#define PMU_LOOP_OP                                         4
#define PMU_POLL_OP                                         5
#define PMU_BRANCH_OP                                       6
#define PMU_TRANSFER_OP                                     7

/* Bit values used in all decroptiors */
#define PMU_NO_INTERRUPT                                    0 /**< Interrupt flag is NOT set at end of channel execution */
#define PMU_INTERRUPT                                       1 /**< Interrupt flag is set at end of channel execution */

#define PMU_NO_STOP                                         0 /**< Do not stop channel after this descriptor ends */
#define PMU_STOP                                            1 /**< Halt PMU channel after this descriptor ends */

/* Interrupt and Stop bit positions */
#define PMU_INT_POS                                         3
#define PMU_STOP_POS                                        4

/* MOVE descriptor bit values */
#define PMU_MOVE_READ_8_BIT                                 0 /**< Read size = 8 */
#define PMU_MOVE_READ_16_BIT                                1 /**< Read size = 16  */
#define PMU_MOVE_READ_32_BIT                                2 /**< Read size = 32 */

#define PMU_MOVE_READ_NO_INC                                0 /**< read address not incremented */
#define PMU_MOVE_READ_INC                                   1 /**< Auto-Increment read address */

#define PMU_MOVE_WRITE_8_BIT                                0 /**< Write Size = 8 */
#define PMU_MOVE_WRITE_16_BIT                               1 /**< Write Size = 16 */
#define PMU_MOVE_WRITE_32_BIT                               2 /**< Write Size = 32 */

#define PMU_MOVE_WRITE_NO_INC                               0 /**< Write address not incremented */
#define PMU_MOVE_WRITE_INC                                  1 /**< Auto_Increment write address */

#define PMU_MOVE_NO_CONT                                    0 /**< MOVE does not rely on previous MOVE */
#define PMU_MOVE_CONT                                       1 /**< MOVE continues from read/write address and INC values defined in previous MOVE */

/* MOVE bit positions */
#define PMU_MOVE_READS_POS                                  5
#define PMU_MOVE_READI_POS                                  7
#define PMU_MOVE_WRITES_POS                                 8
#define PMU_MOVE_WRITEI_POS                                 10
#define PMU_MOVE_CONT_POS                                   11
#define PMU_MOVE_LEN_POS                                    12

/* WRITE descriptor bit values */
#define PMU_WRITE_MASKED_WRITE_VALUE                        0  /**< Value = READ_VALUE & (~WRITE_MASK) | WRITE_VALUE */
#define PMU_WRITE_PLUS_1                                    1  /**< Value = READ_VALUE + 1 */
#define PMU_WRITE_MINUS_1                                   2  /**< Value = READ_VALUE - 1 */
#define PMU_WRITE_SHIFT_RT_1                                3  /**< Value = READ_VALUE >> 1 */
#define PMU_WRITE_SHIFT_LT_1                                4  /**< Value = READ_VALUE << 1 */
#define PMU_WRITE_ROTATE_RT_1                               5  /**< Value = READ_VALUE rotated right by 1 (bit 0 becomes bit 31) */
#define PMU_WRITE_ROTATE_LT_1                               6  /**< Value = READ_VALUE rotated left by 1 (bit 31 becomes bit 0) */
#define PMU_WRITE_NOT_READ_VAL                              7  /**< Value = ~READ_VALUE */
#define PMU_WRITE_XOR_MASK                                  8  /**< Value = READ_VALUE XOR WRITE_MASK */
#define PMU_WRITE_OR_MASK                                   9  /**< Value = READ_VALUE | WRITE_MASK */
#define PMU_WRITE_AND_MASK                                  10 /**< Value = READ_VALUE & WRITE_MASK */

/* WRITE bit positions */
#define PMU_WRITE_METHOD_POS                                8

/* WAIT descriptor bit values */
#define PMU_WAIT_SEL_0                                      0 /**< Select the interrupt source */
#define PMU_WAIT_SEL_1                                      1

/* WAIT bit positions */
#define PMU_WAIT_WAIT_POS                                   5
#define PMU_WAIT_SEL_POS                                    6

/* LOOP descriptor bit values */
#define PMU_LOOP_SEL_COUNTER0                               0 /**< select Counter0 to count down from */
#define PMU_LOOP_SEL_COUNTER1                               1 /**< select Counter1 to count down from */

/* LOOP bit positions */
#define PMU_LOOP_SEL_COUNTER_POS                            5

/* POLL descriptor bit values */
#define PMU_POLL_OR                                         0 /**< polling ends when at least one mask bit matches expected data */
#define PMU_POLL_AND                                        1 /**< polling ends when all mask bits matches expected data */

/* POLL bit positions */
#define PMU_POLL_AND_POS                                    7

/* BRANCH descriptor bit values */
#define PMU_BRANCH_OR                                       0 /**< branch when any mask bit = or != expected data (based on = or != branch type) */
#define PMU_BRANCH_AND                                      1 /**< branch when all mask bit = or != expected data (based on = or != branch type) */

#define PMU_BRANCH_TYPE_NOT_EQUAL                           0 /**< Branch when polled data != expected data */
#define PMU_BRANCH_TYPE_EQUAL                               1 /**< Branch when polled data = expected data */
#define PMU_BRANCH_TYPE_LESS_OR_EQUAL                       2 /**< Branch when polled data <= expected data */
#define PMU_BRANCH_TYPE_GREAT_OR_EQUAL                      3 /**< Branch when polled data >= expected data */
#define PMU_BRANCH_TYPE_LESSER                              4 /**< Branch when polled data < expected data */
#define PMU_BRANCH_TYPE_GREATER                             5 /**< Branch when polled data > expected data */

/* BRANCH bit positions */
#define PMU_BRANCH_AND_POS                                  7
#define PMU_BRANCH_TYPE_POS                                 8

/* TRANSFER descriptor bit values */
#define PMU_TX_READ_8_BIT                                   0 /**< Read size = 8 */
#define PMU_TX_READ_16_BIT                                  1 /**< Read size = 16 */
#define PMU_TX_READ_32_BIT                                  2 /**< Read size = 32 */

#define PMU_TX_READ_NO_INC                                  0 /**< read address not incremented */
#define PMU_TX_READ_INC                                     1 /**< Auto-Increment read address */

#define PMU_TX_WRITE_8_BIT                                  0 /**< Write Size = 8 */
#define PMU_TX_WRITE_16_BIT                                 1 /**< Write Size = 16 */
#define PMU_TX_WRITE_32_BIT                                 2 /**< Write Size = 32 */

